#+TITLE: Examples 1: Probability and Counting
#+PROPERTY: header-args:python :session *Python* :results output :exports both
#+STARTUP: latexpreview

* Newton-Pepys

Which of the following events has the highest probability?

A. at least one 6 appears when 6 dice are rollde
B. at least two 6's appear when 12 dice are rolled
C. at least three 6's appear when 18 dice are rolled

When rolling /n/ dice, the number of outcomes is $6^n$.

NOTE: calculating "Less Than" or "Greater Than" probabilities can be
tricky. Better to break it down into exact numbers. So for "At least 1
or 6", think, "exactly 1 or exactly 2 or...". And then bear in mind
the complement property: You /could/ calculate all of that. Or you could
calculate exactly 0 and take the complement. For part two, it's
exactly zero or exactly 1, instead of 10 different outcomes.

First consider a simpler problem: How many ways are there of seeing
exactly 0, 1, 2 or 3 sixes when you roll 3 dice?

0 is pretty easy: When rolling a dice, there are 5 ways of not rolling
a 6. When rolling /n/ dice, by the multiplication rule, there are $5^n$
ways of not rolling a 6 (picture a tree with all the 6's crossed out).

How many ways are there to get exactly 1 six when you roll 3 dice?
Picture the outcome of the experiment: there's the ghost of 3 dice in
front of you, the upward number is not visible yet. One of them must
be 6. But it can be in any one of the 3 slots. Then the other 2 can be
anything from 1 to 5, we don't care which. There are $5^{2}$ ways
that could happen (1 through 5 in the first empty slot, then 1 through
5 in the second). So multiplying those together you get $3\cdot5^2$

How about exactly 2? Picture the same scenario: ghost dice: exactly 2
must be 6's, but we don't care about which ones. This is the binomial
coeffiecient: 3C2. And that leaves the remaining die to be $5^1$

So generalizing, we can say the number of outcomes for exactly k 6's
is $\binom{n}{k}5^{n-k}$

#+begin_src python
  import math
  def prob_of_k(n,k): return math.comb(n,k) * 5**(n-k) / 6**n
  print(1-prob_of_k(6,0))
  print(1-(prob_of_k(12,0)+prob_of_k(12,1)))
  print(1-(prob_of_k(18,0)+prob_of_k(18,1)+prob_of_k(18,2)))
#+end_src

#+RESULTS:
: 0.6651020233196159
: 0.6186673737323087
: 0.5973456859477232

